package cn.lanca.vo.user;

import lombok.Data;

import java.util.Date;

/**
 * project name:<font size="1"><b>小芄健康数据运营平台</b></font><br>
 * file name:<font size="1"><b>DictTemplate</b></font><br>
 * description:<font size="1"><b>平台字典数据操作实现类</b></font><br>
 * company name:<font size="1"><b>小芄医药科技（成都）有限公司-研发中心</b></font><br>
 *
 * @author <a href="mail to: ">mei.hongliang<br>
 * @version 1.0.0<br>
 * @since 2022/3/7 17:00  <br>
 */
@Data
public class CustomerMemberVo {

    /**
     * 有赞用户id，用户在有赞的唯一id
     */
    private String yzOpenId;
    /**
     * 会员来源方式
     * 0:其他,100:关注公众号,101:Wifi增粉,200:普通下单,201:扫码点单,202:扫码收款,203:外卖点餐,204:堂食点餐,300:外部导入,
     * 301:手工录入,302:三方平台,303:订单导入,400:会员储值,401:APP拓客,500:领取会员卡,600:领取优惠券,601:领取优惠码,700:在线预约,
     * 701:线下预约,800:线上注册,801:导购AI名片,900:咨询客服,901:登陆创建客户,902:成为销售员创建客户,903:绑定销售员成为客户,
     * 904:客户签到成为客户,905:成为家长创建客户(教育店铺),906:参与新品发售),907:授权创建客户,502:会员储值,1000:爱逛,2000:访问下单页面,
     * 2001:访问优惠卷/码页面,2002:访问会员中心页面,2003:访问储值页面,2004:访问权益卡页面,2005:访问签到页面,2006:访问商品页面,
     * 2007:访问微页面,2009:线下门店拉新,3001:添加好友,
     */
    private Integer memberSrcWay;
    /**
     * 成为会员时间 单位:ms
     */
    private Date memberCreatedAt;
    /**
     * 会员来源渠道
     * 0:其他,100:微信,101:微信公众号,102:微信小程序,103:微信朋友圈,104:微信聊天,105:有赞精选小程序,106:微信,107:微信广告,108:爱逛小程序,
     * 200:支付宝,300:微博,400:QQ,401:QQ购物号,500:今日头条,600:浏览器,700:APP,800:其它APP,900:有赞云开放平台,1000:线下门店,
     * 1100:百度小程序,1200:支付宝小程序,1201:线下支付宝支付,1300:QQ小程序,1400:陌陌,1500:知乎,1600:快手,1700:虎牙,1800:斗鱼,
     * 1900:企业微信,2000:三方门店,2100:普惠,
     */
    private Integer memberSrcChannel;


}
